Python 3.13.3 (tags/v3.13.3:6280bb5, Apr  8 2025, 14:47:33) [MSC v.1943 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.
>>> 
================== RESTART: C:/Users/PornHub/Desktop/123123.py =================
Программа для расчета нумерации страниц книги

Выберите действие:
1. Рассчитать количество цифр для заданного количества страниц
2. Определить количество страниц по количеству цифр
3. Выход
Ваш выбор: 1
Введите количество страниц: 345
Для 345 страниц потребуется 927 цифр

Выберите действие:
1. Рассчитать количество цифр для заданного количества страниц
2. Определить количество страниц по количеству цифр
3. Выход
Ваш выбор: 2
Введите количество цифр: 345
При 345 цифрах в книге 151 страниц

Выберите действие:
1. Рассчитать количество цифр для заданного количества страниц
2. Определить количество страниц по количеству цифр
3. Выход
